%=== Завдання #2.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
fs = 100;
eeg=load('eeg1-p4.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(6);
subplot(211), plot(t,eeg), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

%=== Завдання #2.2 ===
% Виділення епохи сигналу ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
fs=100;
t1 = 4.7; 
t2 = 5.8;
n1 = fix(t1*fs) + 1; %номер відліку 1
n2 = fix(t2*fs) + 1; %номер відліку 2
eeg1 = load('eeg1-p4.dat'); %завантажуємо сигнал ЕЕГ
figure(7)
plot(t1,eeg1); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ

%=== Завдання #2.3 ===
% Обчислення незміщеної оцінки АКФ сигналу ЕЕГ
fs = 100;
t=0:1/fs:5; % вектор часу
r = randn(size(t)); %моделюємо шум як вектор випадкових чисел з нормальним розподілом
eeg=load('eeg1-f4.dat'); 
maxlag = fix(100); %максимальна затримка
[r, lags] = xcorr(eeg, maxlag, 'unbiased'
figure(7);
subplot(211),plot(eeg);
title('ЕЕГ'); xlabel('t, с');
subplot(212),plot(lags,r);
title('АКФ'); xlabel('Тривалість затримки, с')

%=== Завдання #2.4 ===
% Обчислення середнього періоду та середньої частоти
N=7; % кількість вершин хвиль
ti=154; %сума інтервалів часу між вершинами сусідніх хвиль;
T=(1/N)*ti;
disp(T)

%=== Завдання #2.5 ===
% Обчислення спектральної щільності сигналу
fs=100;
eeg=load('eeg1-p4.dat'); 
Sy = fft(eeg);
N = length(Sy); 
f = (0:N-1)/N*fs;
Sxx = abs(fft(eeg))/length(eeg);
Sxx = [Sxx(1); 2*Sxx(2:end-1); Sxx(end)];
figure(8);
plot(f,Sxx); %будуємо графік спектральної щільності
title('Спектральна щільність'); xlabel('Частота, f')
