%=== Завдання #3.1 ===
% Завантаження сигналу ЕЕГ файл (eeg1-o2.dat)
fs = 100;
eeg1=load('eeg1-o2.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg1); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(9);
subplot(211), plot(t,eeg1), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

% Завантаження сигналу ЕЕГ файл (eeg1-c3.dat)
fs = 100;
eeg2=load('eeg1-c3.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg2); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(11);
subplot(211), plot(t,eeg2), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

%=== Завдання #3.2 ===
% Виділення епохи сигналів ЕЕГ від t1 = 5,71 с до t2 = 6,78 с
fs=100;
t1 = 5.71; t2 = 6.78;
n1 = fix(t1*fs) + 1; %номер відліку 1
n2 = fix(t2*fs) + 1; %номер відліку 2
eeg1 = load('eeg1-o2.dat'); %завантажуємо сигнал ЕЕГ
eeg2 = load('eeg1-c3.dat'); %завантажуємо сигнал ЕЕГ
figure(12)
subplot(211); plot(t1,eeg1); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ
subplot(212); plot(t2,eeg2); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ

%=== Завдання #3.4 ===
% Обчислення взаємної спектральної щільності сигналів ЕЕГ
%перший сигнал
fs=100;
eeg=load('eeg1-o2.dat'); 
Sy = fft(eeg);
N = length(Sy); 
f = (0:N-1)/N*fs;
Sxx = abs(fft(eeg))/length(eeg);
Sxx = [Sxx(1); 2*Sxx(2:end-1); Sxx(end)];
figure(8);
plot(f,Sxx); %будуємо графік спектральної щільності
title('Спектральна щільність'); xlabel('Частота, f')

%другий сигнал
fs=100;
eeg=load('eeg1-c3.dat'); 
Sy = fft(eeg);
N = length(Sy); 
f = (0:N-1)/N*fs;
Sxx = abs(fft(eeg))/length(eeg);
Sxx = [Sxx(1); 2*Sxx(2:end-1); Sxx(end)];
figure(8);
plot(f,Sxx); %будуємо графік спектральної щільності
title('Спектральна щільність'); xlabel('Частота, f')

%=== Завдання #3.5 ===
% Завантаження сигналу ЕЕГ файл (eeg1-p3.dat)
fs = 100;
eeg1=load('eeg1-p3.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg1); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs; figure(13);
subplot(211), plot(t,eeg1), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

% Завантаження сигналу ЕЕГ файл (eeg1-p4.dat)
fs = 100;
eeg2=load('eeg1-p4.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg2); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(14);
subplot(211), plot(t,eeg2), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

% Виділення епохи сигналів ЕЕГ від t1 = 4,7 с до t2 = 5,8 с
fs=100;
t1 = 4.7; 
t2 = 5.8;
n1 = fix(t1*fs) + 1; %номер відліку 1
n2 = fix(t2*fs) + 1; %номер відліку 2
eeg1 = load('eeg1-p3.dat'); %завантажуємо сигнал ЕЕГ
eeg2 = load('eeg1-p4.dat'); %завантажуємо сигнал ЕЕГ
figure(15)
subplot(211); plot(t1,eeg1); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ
subplot(212); plot(t2,eeg2); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ

%=== Завдання #3.6 ===
% Завантаження сигналу ЕЕГ файл (eeg1-f3.dat)
fs = 100;
eeg1=load('eeg1-f3.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg1); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(16);
subplot(211), plot(t,eeg1), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

% Завантаження сигналу ЕЕГ файл (eeg1-f4.dat)
fs = 100;
eeg2=load('eeg1-f4.dat'); %завантажуємо сигнал ЕЕГ
eegDetr=detrend(eeg2); %видаляємо постійну складову з сигналу
t=(0:length(eegDetr)-1)/fs;
figure(17);
subplot(211), plot(t,eeg2), xlim([1.1 2.1]); %виділяємо діапазон хвилі
title('Сигнал ЕЕГ'); %будуємо графік сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');
subplot(212), plot(t,eegDetr), xlim([1.1 2.1]); %виділяємо діапазон хвилі 
title('Центрований сигнал ЕЕГ'); %будуємо графік центрованого сигналу ЕЕГ
xlabel('Час, t'), ylabel('Амплітуда');

% Виділення епохи сигналів ЕЕГ від t1 = 4,13 с до t2 = 4,96 с t3 = 1,43 с до t4 = 2,26 с
fs=100;
t1 = 5.71; 
t2 = 6.78;
n1 = fix(t1*fs) + 1; %номер відліку 1
n2 = fix(t2*fs) + 1; %номер відліку 2
eeg1 = load('eeg1-f3.dat'); %завантажуємо сигнал ЕЕГ
eeg2 = load('eeg1-f4.dat'); %завантажуємо сигнал ЕЕГ
figure(18)
subplot(211); plot(t1,eeg1); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ
subplot(212); plot(t2,eeg2); xlabel('Час, t');
title('Епоха сигналу ЕЕГ'); %будуємо графік обраної епохи сигналу ЕЕГ


